---
kind: method
id: M:Autodesk.Revit.DB.View.AreGraphicsOverridesAllowed
zh: 视图
source: html/76523fc0-1413-3ba0-d152-893774a7e362.htm
---
# Autodesk.Revit.DB.View.AreGraphicsOverridesAllowed Method

**中文**: 视图

Determines if Visibility/Graphics Overriddes can be applied to the view.

## Syntax (C#)
```csharp
public bool AreGraphicsOverridesAllowed()
```

## Returns
True if Overriddes can be applied to the view, false otherwise.